import 'package:flutter/material.dart';
import 'package:sb7a/screens/quesions/answers.dart';

class Rasols extends StatelessWidget {
  List<String> quesions = [
    'من هم أولو العزم من الرسل ؟',
    'لماذا كانوا هؤلاء الأنبياء من أولو العزم ؟',
    'من هو النبي الذي بعث مرتين إلى قومين مختلفين؟',
    'من هو النبي الذي تعرض لسخرية من قومه؟',
    'من هو النبي الذي تم دفنه في نهر النيل ؟',
    'من هو أول الأنبياء الذي جاهد في سبيل الله؟',
    'من هو النبي الذي نقل بعد موته من مصر إلى فلسطين؟',
    'من هو النبي الذي قال أنا ابن الذبيحين؟',
    'من هو النبي الذي يصوم يوم ويفطر يوم؟',
    'من هو النبي الذي يصوم يومي الاثنين والخميس؟',
    'من هو النبي الذي صام أول مرة؟',
    'من هو النبي الذي صام عن الكلام لمدة ثلاثة أيام؟',
    'من هو كفيل السيدة مريم؟',
    'بماذا وصف القرآن الكريم ادريس عليه السلام؟',
    'من هو أومن من خط بالقلم؟',
    'ما هي السور التي ذكرت ادريس في القرآن؟ ',
    'كم لبث نوح بدعوة قومه لعبادة الله؟',
    'من أول الرسل؟',
    'من هما النبيان اللذان جعل الله في ذريتهما النبوة؟',
    'نجى الله أهل نوح عليه السلام إلا اثنين مَن هما؟',
    'نبيان امرأة كل واحد منهما كافرة من هما؟',
    'من هو النبي الملقب بالصديق؟',
    'من هو النبي الذي لقب بكليم الله؟',
    'من هو خطيب الأنبياء؟',
    'من هو خليل الله؟',
    'من هو النبي الملقب بروح الله؟',
    'من هو النبي الذي كان اسمه بذي النون؟',
    'من هو النبي الذي لقب بشيخ المسلمين؟',
    'من هو النبي الملك؟',
    'من هو النبي الذي لقب بخليفة الله؟',
    'من هو النبي الملقب بسيد الأولين وسيد الآخرين؟',
    'من هو النبي الملقب بالمسيح؟',
    'من هو النبي الذي لقب بأبي اليهود؟',
    'من هو النبي الذي لقب بأبي اليهود؟',
    'ما هو نسب سيدنا ادريس عليه السلام؟',
    'ما هو نسب سيدنا نوح؟',
    'ما هو نسب هود عليه السلام؟',
    'ما هو نسب النبي صالح عليه السلام؟',
    'ما هو نسب النبي إبراهيم عليه السلام؟ ',
    'ما هو نسب لوط عليه السلام؟',
    'ما هو نسب النبي شعيب؟ ',
    'ما هو نسب يعقوب عليه السلام؟',
    'ما هو نسب اليسع عليه السلام؟',
    'ما هو نسب الياس عليه السلام؟',
    'ما هو نسب النبي داوود؟',
    'ما هو نسب النبي سليمان؟',
    'من هو جد العرب من الأنبياء؟',
    'ما هو لقب نبي الله ذا الكفل؟',
    'ما اسم النبي الذي أمره الله بأن يصنع سفينة؟',
    'ما نوع العذاب الذي عذب الله به قوم نوح؟ ',
    'من هو النبي الذي قتل جالوت؟',
    'من هما النبيين اللذين اشتركا في بناء الكعبة؟',
  ];
  List<String> answers = [
    'وهم محمد صلى الله عليه وسلم، وابراهيم عليه السلام، نوح عليه السلام، موسى عليه السلام، عيسى عليه السلام.',
    'كان هؤلاء الخمسة من أولو العزم لأنهم من أفضل الرسل على الإطلاق، حيث أنهم لاقوا من الصعاب مالم يلاقيه أحد غيرهم، أو ممكن لأشياء أخرى يعلمها الله، وكلهم بلا شك فضلاء، حيث أنهم مختارين لإبلاغ رسالة الله سبحانه وتعالى، والله لا يختار لهذه المهمة إلا الأفضل.',
    'سيدنا إدريس عليه السلام.',
    'النبي نوح عليه السلام.',
    'النبي يوسف عليه السلام.',
    'النبي إدريس عليه السلام.',
    'النبي يوسف عليه السلام',
    'هو النبي محمد صلى الله عليه وسلم.',
    'النبي داود.',
    'النبي محمد عليه السلام.',
    'آدم عليه السلام.',
    'زكريا عليه السلام.',
    'زكريا عليه السلام.',
    'وصفه بالصفات التالية: الصبر والصدق والمنزلة الرفيعة.',
    'ادريس عليه السلام.',
    'سورة مريم والأنبياء.',
    'تسعمائة وخمسون عاماً.',
    'نوح عليه السلام.',
    'نوح وابراهيم عليهما السلام.',
    'ابنه وزوجته.',
    'نوح ولوط عليهما السلام.',
    ' النبي يوسف عليه السلام.',
    'هو النبي موسى عليه السلام.',
    'شعيب عليه السلام.',
    'ابراهيم عليه السلام.',
    'عيسى عليه السلام.',
    'يونس عليه السلام.',
    'نوح عليه السلام.',
    ' سليمان عليه السلام.',
    'داود عليه السلام.',
    ' محمد عليه الصلاة والسلام.',
    'عيسى علي السلام.',
    'يعقوب عليه السلام',
    'إسرائيل',
    ' هو ادريس بن يرد بن مهلاييل ويقال خنوخ بالعبرانيه وهرمس الهرامسه أي الأسد الجريء باليونانية.',
    'هو نوح بن لامك بن متوشلخ بن خنوخ ( ادريس ) ابن يرد بن مهلاييل بن قينن بن انوش بن شيث بن ادم ابي البشر عليه السلام.',
    'هود بن شالخ بن ارفخشذ بن سام بن نوح عليه السلام ويقال أنه هو هود بن عبد الله بن رباح بن الجارود بن عاد بنعوص بن ارم بن سام بن نوح عليه السلام.',
    'هو صالح بن عبد بن ماسح بن عبيد بن حاجر بن ثمود بن عابر بن ارم بن سام بن نوح عليه السلام.',
    'ابراهيم بن تارخ بن ناحور بن ساروغ بن راعو ابن فالغ بن عابر بن شالخ بن ارفخشذ بن سام بن نوح عليه السلام. ',
    'لوط بن هاران بن تارخ بن ناحور بن ساروغ بن راعو بن فالغ بن عابر بن شالخ بن ارفخشذ بن سام بن نوح عليه السلام، وهو ابن أخيه لسيدنا ابراهيم عليه السلام.',
    'شعيب بن نويب بن عيفا بن مدين بن ابراهيم. ',
    'يعقوب بن اسحاق بن ابراهيم.',
    'هو اليسع ابن أخطوب وهو ابن عم النبي الياس عليه السلام.',
    'وهو ابن ياسين بن فنحاص بن العيزار بن هارون.',
    'داوود بن ايشا بن عويد بن عابر بن سلمون بن نخشون بن عاويناذب بن عمينا بن ارم بن حصرون بن فارص ابن يهوذا بن يعقوب بن اسحاق بن ابراهيم عليه السلام .',
    'سليمان بن داود بن ايشا بن عويد بن عابر بن سلمون بن نخشون بن عويناذب بن عمينا بن ارم بن حصرون ابن فارص بن يهوذا بن يعقوب بن اسحاق بن ابراهيم عليه السلام.',
    'لقد تم ذكر الأنبياء العرب عليهم السلام في القرآن الكريم فلا يوجد نبي محدد يعتبر جد العرب، وهؤلاء هم: هود، وصالح، وشعيب، وإسماعيل، ومحمد صلى الله عليه وسلم، قال البدوي الشنقيطي في عمود النسب: والعرب إسماعيل منهم دون ريب وهود وصالح محمد شعيب. ',
    ' كان يسمى (بشر) أو (بشير) أو (شرف) والبعض يرى أنه (حزقيل) وذو الكفل هو لقب اطلق عليه.',
    'نوح عليه السلام.',
    'الغرق ',
    ' داود عليه السلام.',
    'إبراهيم وإسماعيل عليهما السلام.',
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          backgroundColor: Colors.lightGreen,
          elevation: .3,
          title: Text('اسئلة عن الانبياء ',textAlign: TextAlign.center,),
          actions: [
            Padding(
              padding: const EdgeInsets.only(right: 8.0),
              child: IconButton(onPressed:(){},icon:Icon(Icons.menu) ),
            ),
          ],
        ),
        body: GridView.count(
          crossAxisCount: 1,
          crossAxisSpacing: 1.0,
          mainAxisSpacing: 1.0,
          childAspectRatio: 1 / 0.7,
          physics: BouncingScrollPhysics(),
          shrinkWrap: true,
          children: List.generate(quesions.length,
              (index) => GestureDetector(child: buildListItem(index,context))),
        ));
    ;
  }

  Widget buildListItem(index,context) {
    return Padding(
      padding: const EdgeInsets.all(8.0),
      child: Card(
        margin: EdgeInsets.all(10),
        child: Column(
          mainAxisSize: MainAxisSize.min,
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            Text(
              '${quesions[index]} ',
              textDirection: TextDirection.rtl,
              textAlign: TextAlign.center,
              maxLines: 2,
              style: TextStyle(fontSize: 20),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 40),
              child: Row(
                mainAxisAlignment: MainAxisAlignment.center,
                children: [
                  Container(
                    width: 150,
                    height: 50,
                    child: ElevatedButton(
                        onPressed: () {
                          Navigator.pushReplacement(context, MaterialPageRoute(builder: (context) => AnswersScreen(questionRa: quesions,answersRa: answers,index: index,screen: Rasols(),) ));
                        },
                        style: ElevatedButton.styleFrom(
                          backgroundColor: Colors.green,
                          shape: RoundedRectangleBorder(
                            borderRadius: BorderRadius.circular(20),
                          )
                        ),

                        child: Text('الاجابة ')
                    ),
                  ),
                ],
              ),
            )
          ],
        ),
      ),
    );
  }


}
